#+TITLE: Error management
#+AUTHOR: DiegoAGtz
#+DATE: <2022-02-18 vie.>

* Try Catch
Si existe un error, cuando nuestro código falla el programa se detendrá.
El bloque try catch captura el error que ocurrió y ejecuta un código.
Es de vital importancia cuando se realizan operaciones criticas, por ejempo, accesos a bases de datos, modificaciones de archivos, etc.

#+begin_src js
try {
    noExistentFunction();
    let a = 3/0;
    console.log(a);
} catch (error) {
    console.log(error);
}
console.log('¡Finalizo!');
#+end_src

#+RESULTS:
#+begin_example
ReferenceError: noExistentFunction is not defined
    at c:\Users\diego\AppData\Local\Temp\babel-laU6t1\js-script-dZUnce:2:5
    at Object.<anonymous> (c:\Users\diego\AppData\Local\Temp\babel-laU6t1\js-script-dZUnce:8:28)
    at Module._compile (node:internal/modules/cjs/loader:1097:14)
    at Object.Module._extensions..js (node:internal/modules/cjs/loader:1149:10)
    at Module.load (node:internal/modules/cjs/loader:975:32)
    at Function.Module._load (node:internal/modules/cjs/loader:822:12)
    at Function.executeUserEntryPoint [as runMain] (node:internal/modules/run_main:77:12)
    at node:internal/main/run_main_module:17:47
¡Finalizo!
undefined
#+end_example
